;Photobooth
[X2Photobooth]
+m_arrAnimationSparkPoses=(AnimationDisplayName="枪落(MEC)")
+m_arrAnimationSparkPoses=(AnimationDisplayName="Gun Up (MEC)")
+m_arrAnimationSparkPoses=(AnimationDisplayName="悠闲 (MEC)")
+m_arrAnimationSparkPoses=(AnimationDisplayName="注意 (MEC)")
+m_arrAnimationSparkPoses=(AnimationDisplayName="手臂在两侧 (MEC)")




;科技
[RM_MecAugmentation X2TechTemplate]
DisplayName="MEC 士兵增强"
Summary=“我在我父亲的旧档案中发现了一些东西，一些关于如果自动化SPARK设计无法及时实施的更绝望的措施。这是一个涉及人与机器融合的项目，希望以一种方式允许志愿者在入侵后过上生活，我认为我们可以创造一个有价值的继任者，对志愿者的要求少一点，但给他们更多的火力。”


；设施升级
[RM_MecFoundry X2FacilityUpgradeTemplate]
DisplayName=“MEC 铸造厂”
FacilityName=“试验场”
Summary=“解锁创建 MEC 士兵的能力。需要机械化战争和 MEC 士兵增强。”


;员工槽位
[RM_MecAugmentationStaffSlot X2StaffSlotTemplate]
EmptyText="打开：需要士兵"
BonusEmptyText="增强士兵成为 MEC 士兵。"
BonusText="增强"
FilledText="%UNITNAME 正在增强！"
LockedText="锁定：购买升级"


；MEC 的位能力

[MecRocketLauncher X2AbilityTemplate]
LocFriendlyName="火箭发射器"
LocHelpText="向目标区域发射火箭。"

[MecShredderGun X2AbilityTemplate]
LocFriendlyName="火焰粉碎枪"
LocHelpText="向锥形区域发射碎纸机枪。"

[MecShredstormCannon X2AbilityTemplate]
LocFriendlyName="粉碎风暴加农炮"
LocHelpText="发射你的粉碎风暴大炮。"

[MecFlamethrower X2AbilityTemplate]
LocFriendlyName=“火焰喷射器”
LocHelpText="在锥形区域喷射火焰。"

[MecFlamethrowerMk2 X2AbilityTemplate]
LocFriendlyName="地狱火投影仪"
LocHelpText="在锥形区域喷射火焰。"

[MecBlasterLauncher X2AbilityTemplate]
LocFriendlyName=“爆炸炸弹”
LocHelpText="向目标区域发射一枚制导爆炸炸弹。"

[MecPlasmaBlaster X2AbilityTemplate]
LocFriendlyName=“等离子冲击波”
LocHelpText="发射你的等离子冲击波。"

;班级能力
[RM_AbsorptionFields X2AbilityTemplate]
LocFriendlyName="吸收场"
LocLongDescription="如果攻击超过 MEC 最大生命值的 <Ability:RMAbsorb/>%，则会被限制为该百分比，如果低于 0，则为 1。"
LocHelpText="将传入的攻击伤害限制为单位当前生命值的一定百分比。"
LocFlyOverText="吸收场"
LocPromotionPopupText="<Bullet/>允许装甲落后的 MEC 在战场上仍然具有竞争力。<br/>"

[RM_ReactiveTargetingSensors X2AbilityTemplate]
LocFriendlyName="反应性目标传感器"
LocLongDescription="任何时候敌人向 MEC 开火，只要还有剩余弹药，MEC 就会开火。"
LocHelpText="对单位的攻击做出还击反应。"
LocFlyOverText="反应式目标传感器"
LocPromotionPopupText="<Bullet/>此特权与更多防御性特权相结合，可以使 MEC 无需直接进入监视状态即可锁定某个区域。<br/>"

[RM_BrutalizeProtocol X2AbilityTemplate]
LocFriendlyName="残酷协议"
LocLongDescription="用超频拳头攻击有机敌人，对其造成巨大伤害，并迫使任何目睹 MEC 的有机目标陷入恐慌。在任务的其余部分减少近战伤害。"
LocHelpText="杀死指定有机目标，并迫使 LOS 中的其他有机目标陷入恐慌。"
LocPromotionPopupText="<Bullet/>残酷协议每个任务只收取一次费用。明智地安排时间，避免长时间遭受近战伤害减免。<br/>"

[RM_BrutalizeBlowback X2AbilityTemplate]
LocFriendlyName="手臂受伤"
LocLongDescription="该手臂已被 MEC 的超频近战攻击损坏，导致近战攻击中伤害减少 -<Ability:BrutalizeBlowback/> 点。"
LocHelpText="该手臂已被 MEC 的超频近战攻击损坏，导致近战攻击中伤害减少 -<Ability:BrutalizeBlowback/> 点。"


[RM_InTheZone X2AbilityTemplate]
LocFriendlyName=“在该区域”
LocLongDescription="用你的<Ability:WeaponName/>杀死侧翼或其他未被覆盖的目标会退还所花费的行动点数。不适用于某些能力。"
LocHelpText="杀死侧翼/暴露的目标时恢复行动点。"
LocFlyOverText="在该区域"
LocPromotionPopupText="<Bullet/>Run and Gun 和 Overclock Core 不会让 In The Zone 功能。<br/>"

[RM_HardenedCore X2AbilityTemplate]
LocFriendlyName="弹性核心"
LocLongDescription="MEC 士兵配备了超级坚固的内部构件，使其免受致命一击。"
LocHelpText="免疫重击。"
LocFlyOverText="弹性核心"
LocPromotionPopupText="<Bullet/>当 MEC 士兵不必担心意外暴击时，它可以走很长的路。<br/>"

[RM_OverclockCore X2AbilityTemplate]
LocFriendlyName="超频核心"
LocLongDescription="MEC 士兵现在可以访问其内部系统，并且可以选择忽略安全限制，以换取对所有可见目标的全面攻击，这将使他们随后变得脆弱。"
LocHelpText="全力对抗眼前的一切（直到你用完弹药），然后关闭一个回合。"
LocFlyOverText="超频核心"
LocPromotionPopupText="<Bullet/> 超频核心需要 <Ability:SelfAmmoCost/> 弹药点，并且具有 <Ability:SelfCooldown/> 回合冷却时间。<br/><Bullet/> 超频核心与瞄准增强器或扩展弹匣结合使用时会非常强大最大限度地提高火力，但会使 MEC 在下一回合中容易受到敌人火力的攻击。<br/>”

[RM_OverheatTrigger X2AbilityTemplate]
LocFriendlyName=“过热”
LocLongDescription="超频核心的使用导致该 MEC 的装甲因过热而关闭。MEC 被击晕，或者如果击晕效果以某种方式减轻，则失去 -50 目标。"
LocHelpText="MEC 在本回合中要么无法行动，要么目标极差。"
LocFlyOverText="过热！"


[RM_RepairProtocol X2AbilityTemplate]
LocFriendlyName="维修伺服系统"
LocLongDescription="MEC 士兵配备了 BIT 自我修复协议的内部版本，允许其每回合再生一些 HP 至给定限制。"
LocHelpText="每回合恢复一些生命值，直至达到上限。"
LocFlyOverText="维修伺服系统"
LocPromotionPopupText="<Bullet/>每个任务的限制最初为 +<Ability:RepairProtocol/>，但会随着 MEC 的装甲等级而增加。<br/>"

[RM_MecSteadfast X2AbilityTemplate]
LocFriendlyName=“坚定”
LocLongDescription="该单位在战斗的恐怖中变得坚定，并且不会惊慌。"
LocHelpText="免疫恐慌。"
LocFlyOverText="坚定"
LocPromotionPopupText="<Bullet/>当单位疲倦或可能遭受各种来源的恐慌影响时可以提供帮助。<br/>"

[RM_SharpArms X2AbilityTemplate]
LocFriendlyName="神枪手电枢"
LocLongDescription="MEC 士兵的手臂经过修改，更加稳定，并允许 MEC 士兵以额外的瞄准和暴击击中坚硬的全掩护目标。"
LocHelpText="获得对全掩护目标的额外瞄准和暴击。"
LocFlyOverText="神射手电枢"
LocPromotionPopupText="<Bullet/>与《守望先锋》结合使用时很有用：从全掩护中逃跑的目标将更容易击中。<br/>"



[RM_MecDmgControl X2AbilityTemplate]
LocFriendlyName=“伤害控制”
LocLongDescription="MEC 士兵每次被敌人击中时都会获得 +<Ability:MecDmgControl/> 护甲值。该效果每次发生时都会刷新。"
LocHelpText="被敌人成功攻击后获得护甲。"
LocFlyOverText="伤害控制"
LocPromotionPopupText="<Bullet/>伤害控制可以大大提高低等级MEC士兵的生存能力，或增强高等级MEC士兵的生存能力。<br/>"

[RM_HammerProtocol X2AbilityTemplate]
LocFriendlyName=“锤子协议”
LocLongDescription="MEC 士兵获得了反近战优化，获得了 75% 的近战攻击抵抗力和对无意识的免疫力。"
LocHelpText="对近战攻击具有抵抗力并且不会被击倒。"
LocFlyOverText="锤子协议"
LocPromotionPopupText="<Bullet/>此能力可以帮助 MEC 士兵应对一些尚未增强的剩余弱点。<br/>"

[RM_SelfDefenceProtocol X2AbilityTemplate]
LocFriendlyName="自卫协议"
LocLongDescription="对任何进入近战范围或从近战范围攻击的敌人进行免费拳头攻击。"
LocHelpText="对任何进入近战范围或从近战范围攻击的敌人进行免费拳头攻击。"
LocFlyOverText="自卫协议"
LocPromotionPopupText="<Bullet/> 如果敌人在相邻方块中开始回合，如果该敌人试图攻击 <Ability:ClassName/>，SDP 将触发。<br/><Bullet/> 如果敌人没有开始回合交出相邻的图块，然后当敌人进入近战范围时 SDP 就会触发。<br/>”

[SDPAtack X2AbilityTemplate]
LocFriendlyName="自卫协议"
LocLongDescription="对任何进入近战范围或从近战范围攻击的敌人进行免费拳头攻击。"
LocHelpText="对任何进入近战范围或从近战范围攻击的敌人进行免费拳头攻击。"
LocFlyOverText="自卫协议"
LocPromotionPopupText="<Bullet/> 如果敌人在相邻方块中开始回合，如果该敌人试图攻击 <Ability:ClassName/>，SDP 将触发。<br/><Bullet/> 如果敌人没有开始回合交出相邻的图块，然后当敌人进入近战范围时 SDP 就会触发。<br/>”

[RM_CollateralDamage X2AbilityTemplate]
LocFriendlyName="附带损害"
LocLongDescription="向目标位置发射一连串子弹，严重破坏其中的环境。对内部的任何目标造成轻微伤害。"
LocHelpText="向目标位置开火，严重损坏或摧毁它。对你的目标造成轻微伤害。"
LocFlyOverText="附带损害"
LocPromotionPopupText="<Bullet/> 附带伤害需要 <Ability:SelfAmmoCost/> 弹药点，并具有 <Ability:SelfCooldown/> 回合冷却时间。<br/><Bullet/> 附带伤害会增加环境伤害，并会摧毁大部分掩体对象。<br/>”
LocMissMessage="错过了！"

[RM_KineticStrike X2AbilityTemplate]
LocFriendlyName="动能打击"
LocLongDescription="用你的 MEC 拳头攻击范围内的任何敌人。"
LocHelpText="用 MEC 拳头攻击范围内的敌人。"
LocPromotionPopupText="<Bullet/> 它缺乏 XCOM 其他近战攻击的范围，但动能打击以更大的伤害弥补了这一点，并且在不结束回合的情况下消耗一个行动点。<br/>"



[RM_ReactiveArmor X2AbilityTemplate]
LocFriendlyName="反应装甲"
LocLongDescription="MEC 士兵的装甲现在包含多层反应镀层，可根据 MEC 的装甲技术水平提供额外的装甲点数。"
LocHelpText="根据 MEC 技术水平获得额外的装甲。"
LocFlyOverText="反应装甲"
LocPromotionPopupText="<Bullet/> 虽然缺乏爆炸衬垫的爆炸防护，但反应装甲通过使 MEC 士兵能够携带先进技术的 Sectopod 级装甲来弥补这一点。<br/>"

[RM_AdvancedFireControl X2AbilityTemplate]
LocFriendlyName="先进火控"
LocLongDescription="MEC 士兵的手臂配备了专门的瞄准装置，可以更快、更有效地捕获目标，使其 <Ability:AFC/>% 的 MEC 瞄准反应射击。"
LocHelpText="在反应射击中获得额外的目标。"
LocFlyOverText="高级火力控制"
LocPromotionPopupText="<Bullet/>只要枪里还有子弹，先进的火力控制就可以使守望先锋专业 MEC 成为致命的力量。<br/>"

[RM_RelocationServos X2AbilityTemplate]
LocFriendlyName="重定位伺服系统"
LocLongDescription="MEC 士兵的身体配备了专门的腿部伺服系统，可以从射击的后坐力中获取能量，使其能够在正常射击后重新定位。"
LocHelpText="正常射击后获得额外移动点。"
LocFlyOverText="重定位伺服系统"
LocPromotionPopupText="<Bullet/> 重定位伺服系统允许 MEC 士兵射击然后移动，使更具风险的战术更加安全。<br/>"

[RM_RelocationServosPassive X2AbilityTemplate]
LocFriendlyName="重定位伺服系统"
LocLongDescription="MEC 士兵的身体配备了专门的腿部伺服系统，可以从射击的后坐力中获取能量，使其能够在正常射击后重新定位。"
LocHelpText="正常射击后获得额外移动点。"
LocFlyOverText="重定位伺服系统"
LocPromotionPopupText="<Bullet/> 重定位伺服系统允许 MEC 士兵射击然后移动，使更具风险的战术更加安全。<br/>"


;小队能力
[RM_BodyShield X2AbilityTemplate]
LocFriendlyName=“身体护盾”
LocLongDescription="MEC 会针对最近的可见目标生成防护罩，从而对它们提供防御。"
LocHelpText="最近的可见目标击中并暴击 MEC 的机会较小。"
LocFlyOverText="身体护盾"
LocPromotionPopupText="<Bullet/> 身体护盾对迷失者不起作用。<br/>"

[RM_ShockAbsorbers X2AbilityTemplate]
LocFriendlyName="减震器"
LocLongDescription="MEC 对 <Ability:ShockAbsorbers/> 方格范围或更小的目标造成的伤害减少 <Ability:ShockAbsorbers/>%。"
LocHelpText="MEC 从近距离目标受到的伤害较少。"
LocFlyOverText="减震器"

[RM_MecTaunt X2AbilityTemplate]
LocFriendlyName="嘲讽"
LocLongDescription="MEC 嘲讽敌人，标记自己，同时也增加 +<Ability:TauntDodge/> 的闪避。"
LocHelpText="MEC 让自己成为目标，并给予他们更多的闪避。"
LocFlyOverText="嘲讽"
LocPromotionPopupText="<Bullet/> 标记效果将使 MEC 成为高优先级目标：注意有多少敌人会瞄准 MEC。<br/>"

;随机套牌能力
[RM_ExtraConditoning X2AbilityTemplate]
LocFriendlyName=“额外调节”
LocLongDescription="该单位已经为战斗做好了准备，给予自己额外的生命值，生命值随护甲的变化而变化。"
LocHelpText="任务开始时获得额外生命值。"
LocFlyOverText="额外调节"
LocPromotionPopupText="<Bullet/> 额外训练可以成为战术领域的救星。但是，它提供的 HP 仍然会计算伤口时间。<br/>"

[RM_MecSprinter X2AbilityTemplate]
LocFriendlyName=“短跑运动员”
LocLongDescription="该单位已接受过训练，可在野外获得 +<Ability:MecSprinter/> 机动性。"
LocHelpText="在任务开始时获得额外的机动性。"
LocFlyOverText="短跑运动员"
LocPromotionPopupText="<Bullet/> Sprinter 与其他机动性增强功能结合使用时，可以进行一些通常不可能的极端侧翼攻击。<br/>"






;角色模板
[XComMECSoldier X2CharacterTemplate]
strCharacterName="MEC 士兵"
strCharacterBackgroundMale[0]="在<XGParam:StrValue0/!CountryName/>的偏远社区长大，<XGParam:StrValue1/!FirstName/>从小就学会了生存的艺术。被灌输了强烈的自力更生意识，他渴望尽自己的一份力量来夺回地球。”
strCharacterBackgroundMale[1]="人们说 <XGParam:StrValue1/!FirstName/> 在得知地球政府已向外星人投降后失去了它并变得流氓。流行的谣言是他自从在 <XGParam:StrValue0 中度过了大部分时间/!CountryName/>，以狩猎外星人为运动。”
strCharacterBackgroundMale[2]="<XGParam:StrValue1/!FirstName/> 在入侵期间与家人失散。他最终奋力穿越 <XGParam:StrValue0/!CountryName/>，显然是靠自己的力量生存下来的几年。”
strCharacterBackgroundMale[3]="在 <XGParam:StrValue0/!CountryName/> 出生和长大，<XGParam:StrValue1/!FirstName/> 是一个通配符，没有受过正规训练。他可能就是这样的人XCOM 的招募需求。”
strCharacterBackgroundMale[4]="部队中流传的说法是 <XGParam:StrValue1/!FirstName/> 实际上是一名囚犯，直到最近才被关押在 <XGParam:StrValue0/!CountryName/> 中。自从他被释放后，他就获得了可怕的名声从敌方战斗人员那里收集战利品。”
strCharacterBackgroundMale[5]="<XGParam:StrValue1/!FirstName/> 的举止像个退伍军人，但一直不愿意谈论他过去在 <XGParam:StrValue0/!CountryName/> 服役的细节。CO Bradford 注释：让熟睡的狗撒谎吧。”
strCharacterBackgroundMale[6]="作为 <XGParam:StrValue0/!CountryName/> 中的非正规民兵部队的一部分，简称为勇士队，<XGParam:StrValue1/!FirstName/> 受伤，后来被 ADVENT 俘虏。我们不完全确定为什么他没有与其他囚犯一起被处理。”
strCharacterBackgroundMale[7]="回到 <XGParam:StrValue0/!CountryName/>，<XGParam:StrValue1/!FirstName/> 是有关他参与秘密军事行动的长期谣言的主题。他将有很多机会在接下来的几周里证明自己。”
strCharacterBackgroundMale[8]="抵抗组织对最近招募的几名新兵实际上可能是 <XGParam:StrValue0/!CountryName/> 戒备森严的监狱设施中的逃犯感到担忧。<XGParam:StrValue1/!FirstName/>列在他们可能被拘留的名单上，但目前我们无法拒绝熟练战士，无论他们身在何处。”
strCharacterBackgroundMale[9]="<XGParam:StrValue1/!FirstName/> 在 <XGParam:StrValue0/!CountryName/> 的一个市中心外被外星军队抓获。他显然使用一辆偷来的车辆撞上了其中一辆 ADVENT显然，这没有成功，但我们喜欢他的直觉。”
strCharacterBackgroundFemale[0]="在<XGParam:StrValue0/!CountryName/>的偏远社区长大，<XGParam:StrValue1/!FirstName/>从小就学会了生存的艺术。被灌输了强烈的自力更生意识，她渴望尽自己的一份力量来夺回地球。”
strCharacterBackgroundFemale[1]="人们说 <XGParam:StrValue1/!FirstName/> 在得知地球政府已向外星人投降后失去了它并变得流氓。流行的谣言是自从她在 <XGParam:StrValue0 中度过了大部分时间/!CountryName/>，以狩猎外星人为运动。”
strCharacterBackgroundFemale[2]="<XGParam:StrValue1/!FirstName/> 在入侵期间与家人失散。她最终奋力穿越 <XGParam:StrValue0/!CountryName/>，显然在过去的几年里都是靠自己生存的年。”
strCharacterBackgroundFemale[3]="在 <XGParam:StrValue0/!CountryName/> 出生和长大，<XGParam:StrValue1/!FirstName/> 是一个通配符，没有受过正式训练可言。她可能就是这样的人XCOM 的招募需求。”
strCharacterBackgroundFemale[4]="部队中流传的说法是 <XGParam:StrValue1/!FirstName/> 实际上是一名囚犯，直到最近才被关押在 <XGParam:StrValue0/!CountryName/> 中。自从她被释放后，她就获得了可怕的名声从敌方战斗人员那里收集战利品。”
strCharacterBackgroundFemale[5]="<XGParam:StrValue1/!FirstName/> 的举止像退伍军人，但一直不愿意谈论她过去在 <XGParam:StrValue0/!CountryName/> 服役的细节。CO Bradford 注释：让熟睡的狗撒谎吧。”
strCharacterBackgroundFemale[6]="作为 <XGParam:StrValue0/!CountryName/> 中的非正规民兵部队的一部分，简称为勇士队，<XGParam:StrValue1/!FirstName/> 受伤，后来被 ADVENT 俘虏。我们不完全确定为什么她没有与其他囚犯一起被处理。”
strCharacterBackgroundFemale[7]="回到<XGParam:StrValue0/!CountryName/>，<XGParam:StrValue1/!FirstName/>是关于她参与秘密军事行动的长期谣言的主题。她将有很多机会在接下来的几周里证明自己。”
strCharacterBackgroundFemale[8]="抵抗运动中有人担心最近招募的几名新兵实际上可能是 <XGParam:StrValue0/!CountryName/> 戒备森严的监狱设施中的越狱者。<XGParam:StrValue1/!FirstName/>列在他们可能被拘留的名单上，但目前我们无法拒绝熟练战士，无论他们身在何处。”
strCharacterBackgroundFemale[9]="<XGParam:StrValue1/!FirstName/> 在 <XGParam:StrValue0/!CountryName/> 的一个市中心外被外星军队抓住。她显然使用一辆偷来的车辆撞上了其中一辆 ADVENT显然，这没有成功，但我们喜欢她的直觉。”



;类文本
[RM_DefaultMecTrooper X2SoldierClassTemplate]
DisplayName="MEC 士兵"
ClassSummary="MEC 士兵是人类和机器的混合体，专门从事前线、重击角色。"
LeftAbilityTreeTitle="战士"
RightAbilityTreeTitle="泰坦"

AbilityTreeTitles[0]="战士"
AbilityTreeTitles[1]="Jaeger"
AbilityTreeTitles[2]="泰坦"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="Rook"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="重装步兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="禁卫军"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="剑杆"
RandomNickNames[14]="晨星"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="正宗"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="冈尼尔"
RandomNickNames[22]="雷神之锤"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]=“千兆”
RandomNickNames[28]="恶意软件"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="粉碎者"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="碎片"


;按字母顺序
RandomNickNames_Male[0]="大爸爸"
RandomNickNames_Male[1]="钢铁侠"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="魔像"
RandomNickNames_Male[4]="卡利班"
RandomNickNames_Male[5]="杜克"

;按字母顺序
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="公爵夫人"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁娘子"
RandomNicknames_Female[4]="盾女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐姐"

;按字母顺序
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨头都断了！"
PhotoboothSoloBLines_Male[1]="这个坏小子能打这么多拳。"
PhotoboothSoloBLines_Male[2]="这个 MEC 杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨头都断了！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能承受这么多拳。"
PhotoboothSoloBLines_Female[2]="这个 MEC 杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"

[RM_CannonMecTrooper X2SoldierClassTemplate]
DisplayName=“MEC 重型”
ClassSummary="MEC 士兵是人类和机器的混合体，专门从事前线、重击角色。"
LeftAbilityTreeTitle="战士"
RightAbilityTreeTitle="泰坦"

AbilityTreeTitles[0]="战士"
AbilityTreeTitles[1]="Jaeger"
AbilityTreeTitles[2]="泰坦"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="Rook"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="重装步兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="禁卫军"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="剑杆"
RandomNickNames[14]="晨星"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="正宗"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="冈尼尔"
RandomNickNames[22]="雷神之锤"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]=“千兆”
RandomNickNames[28]="恶意软件"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="粉碎者"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="碎片"


;按字母顺序
RandomNickNames_Male[0]="大爸爸"
RandomNickNames_Male[1]="钢铁侠"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="魔像"
RandomNickNames_Male[4]="卡利班"
RandomNickNames_Male[5]="杜克"

;按字母顺序
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="公爵夫人"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁娘子"
RandomNicknames_Female[4]="盾女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐姐"

;按字母顺序
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨头都断了！"
PhotoboothSoloBLines_Male[1]="这个坏小子能打这么多拳。"
PhotoboothSoloBLines_Male[2]="这个 MEC 杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨头都断了！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能承受这么多拳。"
PhotoboothSoloBLines_Female[2]="这个 MEC 杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"


[RM_SniperMecTrooper X2SoldierClassTemplate]
DisplayName="MEC 神射手"
ClassSummary="MEC 士兵是人类和机器的混合体，专门从事前线、重击角色。"
LeftAbilityTreeTitle="战士"
RightAbilityTreeTitle="泰坦"

AbilityTreeTitles[0]="战士"
AbilityTreeTitles[1]="Jaeger"
AbilityTreeTitles[2]="泰坦"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="Rook"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="重装步兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="禁卫军"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="剑杆"
RandomNickNames[14]="晨星"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="正宗"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="冈尼尔"
RandomNickNames[22]="雷神之锤"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]=“千兆”
RandomNickNames[28]="恶意软件"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="粉碎者"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="碎片"


;按字母顺序
RandomNickNames_Male[0]="大爸爸"
RandomNickNames_Male[1]="钢铁侠"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="魔像"
RandomNickNames_Male[4]="卡利班"
RandomNickNames_Male[5]="杜克"

;按字母顺序
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="公爵夫人"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁娘子"
RandomNicknames_Female[4]="盾女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐姐"

;按字母顺序
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨头都断了！"
PhotoboothSoloBLines_Male[1]="这个坏小子能打这么多拳。"
PhotoboothSoloBLines_Male[2]="这个 MEC 杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨头都断了！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能承受这么多拳。"
PhotoboothSoloBLines_Female[2]="这个 MEC 杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"



[RM_ShotgunMecTrooper X2SoldierClassTemplate]
DisplayName=“MEC 突击”
ClassSummary="MEC 士兵是人类和机器的混合体，专门从事前线、重击角色。"
LeftAbilityTreeTitle="战士"
RightAbilityTreeTitle="泰坦"

AbilityTreeTitles[0]="战士"
AbilityTreeTitles[1]="Jaeger"
AbilityTreeTitles[2]="泰坦"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="Rook"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="重装步兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="禁卫军"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="剑杆"
RandomNickNames[14]="晨星"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="正宗"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="冈尼尔"
RandomNickNames[22]="雷神之锤"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]=“千兆”
RandomNickNames[28]="恶意软件"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="粉碎者"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="碎片"


;按字母顺序
RandomNickNames_Male[0]="大爸爸"
RandomNickNames_Male[1]="钢铁侠"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="魔像"
RandomNickNames_Male[4]="卡利班"
RandomNickNames_Male[5]="杜克"

;按字母顺序
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="公爵夫人"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁娘子"
RandomNicknames_Female[4]="盾女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐姐"

;按字母顺序
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨头都断了！"
PhotoboothSoloBLines_Male[1]="这个坏小子能打这么多拳。"
PhotoboothSoloBLines_Male[2]="这个 MEC 杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨头都断了！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能承受这么多拳。"
PhotoboothSoloBLines_Female[2]="这个 MEC 杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"


[RM_ReaperMecTrooper X2SoldierClassTemplate]
DisplayName=“MEC 侦察”
ClassSummary="MEC 士兵是人类和机器的混合体，专门从事前线、重击角色。"
LeftAbilityTreeTitle="战士"
RightAbilityTreeTitle="泰坦"

AbilityTreeTitles[0]="战士"
AbilityTreeTitles[1]="Jaeger"
AbilityTreeTitles[2]="泰坦"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="Rook"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="重装步兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="禁卫军"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="剑杆"
RandomNickNames[14]="晨星"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="正宗"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="冈尼尔"
RandomNickNames[22]="雷神之锤"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]=“千兆”
RandomNickNames[28]="恶意软件"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="粉碎者"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="碎片"


;按字母顺序
RandomNickNames_Male[0]="大爸爸"
RandomNickNames_Male[1]="钢铁侠"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="魔像"
RandomNickNames_Male[4]="卡利班"
RandomNickNames_Male[5]="杜克"

;按字母顺序
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="公爵夫人"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁娘子"
RandomNicknames_Female[4]="盾女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐姐"

;按字母顺序
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨头都断了！"
PhotoboothSoloBLines_Male[1]="这个坏小子能打这么多拳。"
PhotoboothSoloBLines_Male[2]="这个 MEC 杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨头都断了！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能承受这么多拳。"
PhotoboothSoloBLines_Female[2]="这个 MEC 杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"



[RM_SkirmisherMecTrooper X2SoldierClassTemplate]
DisplayName="MEC 散兵"
ClassSummary="MEC 士兵是人类和机器的混合体，专门从事前线、重击角色。"
LeftAbilityTreeTitle="战士"
RightAbilityTreeTitle="泰坦"

AbilityTreeTitles[0]="战士"
AbilityTreeTitles[1]="Jaeger"
AbilityTreeTitles[2]="泰坦"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="Rook"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="重装步兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="禁卫军"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="剑杆"
RandomNickNames[14]="晨星"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="正宗"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="冈尼尔"
RandomNickNames[22]="雷神之锤"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]=“千兆”
RandomNickNames[28]="恶意软件"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="粉碎者"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="碎片"


;按字母顺序
RandomNickNames_Male[0]="大爸爸"
RandomNickNames_Male[1]="钢铁侠"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="魔像"
RandomNickNames_Male[4]="卡利班"
RandomNickNames_Male[5]="杜克"

;按字母顺序
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="公爵夫人"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁娘子"
RandomNicknames_Female[4]="盾女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐姐"

;按字母顺序
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨头都断了！"
PhotoboothSoloBLines_Male[1]="这个坏小子能打这么多拳。"
PhotoboothSoloBLines_Male[2]="这个 MEC 杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨头都断了！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能承受这么多拳。"
PhotoboothSoloBLines_Female[2]="这个 MEC 杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"
